Repository: linuxdeepin/desktop-plugins
Catalog: weather/locale/po/*/weather.po
Languages: ar

source: No network
ar: لا توجد شبكة

source: choose city
ar: أختر مدينة

source: loading
ar: يتم التحميل

source: Sun
ar: الأحد

source: Mon
ar: الأثنين

source: Tue
ar: الثلاثاء

source: Wed
ar: الأربعاء

source: Thu
ar: الخميس

source: Fri
ar: الجمعة

source: Sat
ar: السبت

source: tornado
ar: زوبعة

source: tropical storm
ar: عاصفة استوائية

source: hurricane
ar: إعصار

source: severe thunderstorms
ar: عواصف رعدية شديدة

source: thunderstorms
ar: عواصف رعدية

source: mixed rain and snow
ar: مطر و ثلج مختلط

source: mixed rain and sleet
ar: مطر و صقيع مختلط

source: mixed snow and sleet
ar: ثلج و صقيع مختلط

source: freezing drizzle
ar: رذاذ متجمد

source: drizzle
ar: رذاذ

source: freezing rain
ar: مطر متجمد

source: showers
ar: أمطار

source: snow flurries
ar: هبوب ثلجية

source: light snow showers
ar: زخات ثلج خفيفة

source: blowing snow
ar: عاصفة ثلجية

source: snow
ar: ثلج

source: hail
ar: برد

source: sleet
ar: مطر متجمد

source: dust
ar: غبار

source: foggy
ar: ضبابي

source: haze
ar: ضباب

source: smoky
ar: دخاني

source: blustery
ar: متهيج

source: windy
ar: رياح عاصفة

source: cold
ar: بارد

source: cloudy
ar: غائم

source: mostly cloudy (night)
ar: غائم كلياً (الليل)

source: mostly cloudy (day)
ar: غائم كلياً (النهار)

source: partly cloudy (night)
ar: غائم جزئي (الليل)

source: partly cloudy (day)
ar: غائم جزئي (النهار)

source: clear (night)
ar: واضح (الليل)

source: sunny
ar: مشمس

source: fair (night)
ar: معتدل (الليل)

source: fair (day)
ar: معتدل (النهار)

source: mixed rain and hail
ar: مزيج مطر و برد

source: hot
ar: حار

source: isolated thunderstorms
ar: عواصف رعدية منفصلة

source: scattered thunderstorms
ar: عواصف رعدية متفرقة

source: scattered thunderstorm
ar: عاصفة رعدية متفرقة

source: scattered showers
ar: أمطار متفرقة

source: heavy snow
ar: ثلوج كثيفة

source: scattered snow showers
ar: زخات ثلج متفرقة

source: partly cloudy
ar: غائم جزئي

source: thundershowers
ar: زخات مطر رعدية

source: snow showers
ar: زخات ثلج

source: isolated thundershowers
ar: عواصف رعدية منعزلة

source: 3200 not available
ar: 3200 غير متوفر

source: Switch to Fahrenheit
ar: التبديل إلى فهرنهايت

source: Switch to Celsius
ar: التبديل إلى مئوي
